project/app/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    # byebug
    # params
    # params[:id]

    # pause web server to debug
    # this uses a Params hash, its a hash data structure
    # variable only works within this block
    # so make a variable into an instance variable
    # this makes it available inside the show/view
    @article = Article.find(params[:id])